//BANKJOB5 JOB (ACCT),'BANCO5',CLASS=A,MSGCLASS=H,
//             MSGLEVEL=(1,1),NOTIFY=HERC01
//*
//* STEP1
//*
//SORTCLI  EXEC PGM=SORT
//SORTLIB  DD DSN=SYS1.SORTLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=HERC01.BANCO5.CLIENTES,DISP=SHR
//SORTOUT  DD DSN=HERC01.BANCO5.CLIENTES.ORD,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(TRK,(1,1)),
//            DCB=(RECFM=FB,LRECL=44,BLKSIZE=440)
//SYSIN    DD *
  SORT FIELDS=(1,5,CH,A)
/*
//*
//* STEP2
//*
//SORTTRX  EXEC PGM=SORT
//SORTLIB  DD DSN=SYS1.SORTLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=HERC01.BANCO5.TRX,DISP=SHR
//SORTOUT  DD DSN=HERC01.BANCO5.TRX.ORD,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(TRK,(1,1)),
//            DCB=(RECFM=FB,LRECL=20,BLKSIZE=200)
//SYSIN    DD *
  SORT FIELDS=(1,5,CH,A)
/*
//*
//* STEP3
//*
//COBOL    EXEC COBUCL,
//         PARM.COB='FLAGW,LOAD,SUPMAP,SIZE=2048K,BUF=1024K,LIB,NOZWB'
//COB.SYSIN DD DSN=HERC01.BANCO5.CBL(BANK005),DISP=SHR
//LKED.SYSLMOD DD DSN=HERC01.BANCO5.LOAD(BANK005),
//             DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,
//             SPACE=(1024,(50,20,1))
//*
//* STEP4 - EXECUTA O PROGRAMA
//*
//EXEC     EXEC PGM=BANK005,
//             COND=(8,LT,COBOL.COB)
//STEPLIB  DD DSN=HERC01.BANCO5.LOAD,DISP=SHR
//CLIENTES DD DSN=HERC01.BANCO5.CLIENTES.ORD,DISP=SHR
//TRX      DD DSN=HERC01.BANCO5.TRX.ORD,DISP=SHR
//SAIDACLI DD DSN=HERC01.BANCO5.SAIDACLI,DISP=SHR
//ERROS    DD DSN=HERC01.BANCO5.ERROS,DISP=SHR
//SYSOUT   DD SYSOUT=*
