//HERC01XX JOB (PROG2),
//             'EXECUTA PROG1',
//             CLASS=A,
//             MSGCLASS=H,
//             REGION=8M,TIME=1440,
//             MSGLEVEL=(1,1),
//             NOTIFY=HERC01
//COMPILA  EXEC COBOL,
//         PROG='PROG1',
//         BIBF='HERC01.PRIVLIB.SOURCE',
//         BIBC='HERC01.PRIVLIB.LOAD'
