//HERC010A JOB (COBOL),
//             'COMPILACION COBOL',
//             CLASS=A,
//             MSGCLASS=H,
//             REGION=8M,TIME=1440
//IEFBR14   EXEC PGM=IEFBR14
//SYSPRINT  DD   SYSOUT=*
//ENTRADA   DD   DUMMY
//ARQUIVO   DD   DSN=HERC01.ARQ.CLIENTES,DISP=(NEW,CATLG,DELETE),
//          SPACE=(TRK,(1,1),RLSE),
//          UNIT=SYSDA,
//          DCB=(RECFM=FB,LRECL=50,BLKSIZE=19050,BUFNO=2)
